PQSolutionsPeru/ESP32-IDF/ESP-IDF-HDDESP32/hddesp32/main/hddesp32_main.c
#include <stdio.h>
#include <inttypes.h>
#include <string.h>
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "esp_system.h"
#include "custom_logging.h"
#include "nvs_flash.h"
#include "config_manager.h"
#include "esp32_id_manager.h"
#include "wifi_manager.h"
#include "wifi_captive_portal.h"
#include "mqtt_manager.h"
#include "time_manager.h"
#include "watchdog_manager.h"
#include "relay_manager.h"
#include "esp_heap_caps.h"
#include "esp_task_wdt.h"
#include "config_processor.h"
#include "esp_timer.h"

static const char *TAG = "HDDESP32";

static bool g_system_initialized = false;
static bool g_wifi_connected = false;
static bool g_mqtt_connected = false;
static bool g_watchdog_available = false;
static bool g_relay_manager_initialized = false;
static bool g_need_reregister = false;

static char g_relay_json_buffer[256];
static char g_mqtt_temp_topic[128];
static char g_mqtt_temp_data[400];
static char g_esp32_id_buffer[ESP32_ID_LENGTH + 1];

static SemaphoreHandle_t g_callback_mutex = NULL;
static SemaphoreHandle_t g_global_state_mutex = NULL;

static bool get_wifi_connected(void) {
    bool result = false;
    if (xSemaphoreTake(g_global_state_mutex, pdMS_TO_TICKS(10)) == pdTRUE) {
        result = g_wifi_connected;
        xSemaphoreGive(g_global_state_mutex);
    }
    return result;
}

static void set_wifi_connected(bool connected) {
    if (xSemaphoreTake(g_global_state_mutex, pdMS_TO_TICKS(10)) == pdTRUE) {
        g_wifi_connected = connected;
        xSemaphoreGive(g_global_state_mutex);
    }
}

static bool get_mqtt_connected(void) {
    bool result = false;
    if (xSemaphoreTake(g_global_state_mutex, pdMS_TO_TICKS(10)) == pdTRUE) {
        result = g_mqtt_connected;
        xSemaphoreGive(g_global_state_mutex);
    }
    return result;
}

static void set_mqtt_connected(bool connected) {
    if (xSemaphoreTake(g_global_state_mutex, pdMS_TO_TICKS(10)) == pdTRUE) {
        g_mqtt_connected = connected;
        xSemaphoreGive(g_global_state_mutex);
    }
}

static bool get_relay_manager_initialized(void) {
    bool result = false;
    if (xSemaphoreTake(g_global_state_mutex, pdMS_TO_TICKS(10)) == pdTRUE) {
        result = g_relay_manager_initialized;
        xSemaphoreGive(g_global_state_mutex);
    }
    return result;
}

static void set_relay_manager_initialized(bool initialized) {
    if (xSemaphoreTake(g_global_state_mutex, pdMS_TO_TICKS(10)) == pdTRUE) {
        g_relay_manager_initialized = initialized;
        xSemaphoreGive(g_global_state_mutex);
    }
}

static void print_memory_info_simple(void) {
    size_t free_heap = esp_get_free_heap_size();
    size_t min_heap = esp_get_minimum_free_heap_size();
    
    LOG_I(TAG, "Memory: free=%zu min=%zu", free_heap, min_heap);
    
    if (g_watchdog_available) {
        watchdog_manager_report_activity(WATCHDOG_CHECK_MEMORY);
    }
}

static char* find_json_value(const char *json, const char *key, char *value_buf, size_t buf_size) {
    char search_key[64];
    snprintf(search_key, sizeof(search_key), "\"%s\":", key);
    
    char *start = strstr(json, search_key);
    if (!start) {
        return NULL;
    }
    
    start += strlen(search_key);
    while (*start == ' ' || *start == '\t') start++;
    
    if (*start == '"') {
        start++;
        char *end = strchr(start, '"');
        if (!end) return NULL;
        
        size_t len = end - start;
        if (len >= buf_size) len = buf_size - 1;
        
        memcpy(value_buf, start, len);
        value_buf[len] = '\0';
        return value_buf;
    } else {
        char *end = start;
        while (*end && *end != ',' && *end != '}' && *end != ' ') end++;
        
        size_t len = end - start;
        if (len >= buf_size) len = buf_size - 1;
        
        memcpy(value_buf, start, len);
        value_buf[len] = '\0';
        return value_buf;
    }
}

static bool parse_json_bool(const char *json, const char *key) {
    char value_buf[16];
    char *value = find_json_value(json, key, value_buf, sizeof(value_buf));
    if (!value) return false;
    
    return (strcmp(value, "true") == 0 || strcmp(value, "1") == 0);
}

static void watchdog_event_callback(watchdog_health_status_t status, watchdog_check_type_t check_type, void *user_data) {
    const char* status_str = "UNKNOWN";
    const char* check_str = "UNKNOWN";
    
    switch (status) {
        case WATCHDOG_HEALTH_GOOD: status_str = "GOOD"; break;
        case WATCHDOG_HEALTH_WARNING: status_str = "WARNING"; break;
        case WATCHDOG_HEALTH_CRITICAL: status_str = "CRITICAL"; break;
        case WATCHDOG_HEALTH_ERROR: status_str = "ERROR"; break;
    }
    
    switch (check_type) {
        case WATCHDOG_CHECK_MEMORY: check_str = "MEMORY"; break;
        case WATCHDOG_CHECK_WIFI: check_str = "WIFI"; break;
        case WATCHDOG_CHECK_MQTT: check_str = "MQTT"; break;
        case WATCHDOG_CHECK_TASKS: check_str = "TASKS"; break;
    }
    
    LOG_W(TAG, "Watchdog event: %s - %s", check_str, status_str);
    
    if (status == WATCHDOG_HEALTH_CRITICAL) {
        switch (check_type) {
            case WATCHDOG_CHECK_MEMORY:
                LOG_E(TAG, "Critical memory situation detected");
                break;
                
            case WATCHDOG_CHECK_WIFI:
                LOG_E(TAG, "Critical WiFi failure detected");
                if (!wifi_manager_is_connected()) {
                    char ap_ssid[33];
                    esp_err_t ret = wifi_manager_generate_ap_ssid(ap_ssid, sizeof(ap_ssid), "FirePanel");
                    if (ret == ESP_OK) {
                        LOG_I(TAG, "Starting emergency AP mode: %s", ap_ssid);
                        wifi_manager_start_ap_mode(ap_ssid, "firepanel");
                    }
                }
                break;
                
            case WATCHDOG_CHECK_MQTT:
                LOG_E(TAG, "Critical MQTT failure detected");
                if (esp32_id_manager_get_id(g_esp32_id_buffer, sizeof(g_esp32_id_buffer)) == ESP_OK) {
                    mqtt_manager_set_esp32_id(g_esp32_id_buffer);
                    mqtt_manager_connect();
                }
                break;
                
            case WATCHDOG_CHECK_TASKS:
                LOG_E(TAG, "Critical task failure detected");
                break;
        }
    } else if (status == WATCHDOG_HEALTH_WARNING) {
        LOG_W(TAG, "System degradation detected in %s subsystem", check_str);
    }
}

static void relay_state_change_callback(const relay_event_t *event, void *user_data) {
    if (!get_mqtt_connected() || !event || !g_callback_mutex) {
        return;
    }

    if (xSemaphoreTake(g_callback_mutex, pdMS_TO_TICKS(100)) != pdTRUE) {
        LOG_W(TAG, "Could not take callback mutex");
        return;
    }
    
    if (g_watchdog_available) {
        watchdog_manager_report_activity(WATCHDOG_CHECK_TASKS);
    }
    
    if (esp32_id_manager_get_id(g_esp32_id_buffer, sizeof(g_esp32_id_buffer)) != ESP_OK) {
        LOG_E(TAG, "Could not get ESP32 ID for relay event");
        xSemaphoreGive(g_callback_mutex);
        return;
    }
    
    size_t json_size = 300 + strlen(event->relay_id) + strlen(event->name);
    
    if (esp_get_free_heap_size() < json_size + 8000) {
        LOG_W(TAG, "Insufficient memory for relay event, using static fallback");
        
