PQSolutionsPeru/ESP32-IDF/ESP-IDF-HDDESP32/hddesp32/main/hddesp32_main.c
    if (strcmp(topic, g_mqtt_temp_topic) == 0) {
        LOG_W(TAG, "Deletion notification received");
        
        config_manager_erase_key("client_id");
        config_manager_erase_key("panel_id");
        config_manager_erase_key("panel_name");
        config_manager_erase_key("location");
        mqtt_manager_clear_panel_config();
        
        if (get_relay_manager_initialized()) {
            relay_mgr_state_t state = relay_manager_get_mgr_state();
            if (state == RELAY_MGR_STATE_RUNNING) {
                relay_manager_deinit();
                set_relay_manager_initialized(false);
                vTaskDelay(pdMS_TO_TICKS(3000));
            }
        }
        
        time_manager_reset_network_info_sent();
        g_need_reregister = true;
        vTaskDelay(pdMS_TO_TICKS(1000));
        mqtt_manager_send_network_info();
        
        if (use_dynamic) free(mqtt_temp_data);
        return;
    }
    
    snprintf(g_mqtt_temp_topic, sizeof(g_mqtt_temp_topic), "esp32/config/%s", g_esp32_id_buffer);
    
    if (strcmp(topic, g_mqtt_temp_topic) == 0) {
        LOG_I(TAG, "Configuration message received");
        
        esp_err_t ret = process_esp32_configuration(mqtt_temp_data);
        
        if (ret == ESP_OK) {
            LOG_I(TAG, "Configuration accepted");
            
            if (!get_relay_manager_initialized()) {
                vTaskDelay(pdMS_TO_TICKS(500));
                LOG_I(TAG, "Initializing Relay Manager");
                ret = relay_manager_init();
                if (ret == ESP_OK) {
                    relay_manager_set_state_callback(relay_state_change_callback, NULL);
                    relay_manager_set_mqtt_callback(relay_mqtt_command_callback, NULL);
                    set_relay_manager_initialized(true);
                }
            }
        }
        
        if (use_dynamic) free(mqtt_temp_data);
        return;
    }
    
    if (strstr(topic, "/relay_config") && get_relay_manager_initialized()) {
        if (data_len > 2000) {
            LOG_W(TAG, "Relay config message too large, ignoring");
            if (use_dynamic) free(mqtt_temp_data);
            return;
        }
        
        char command_val[32], relay_id_val[32], is_active_val[16];
        char contact_type_val[16], custom_name_val[64];
        
        if (find_json_value(mqtt_temp_data, "command", command_val, sizeof(command_val)) &&
            find_json_value(mqtt_temp_data, "relay_id", relay_id_val, sizeof(relay_id_val)) &&
            strcmp(command_val, "update_config") == 0) {
            
            if (find_json_value(mqtt_temp_data, "is_active", is_active_val, sizeof(is_active_val))) {
                bool is_active = parse_json_bool(mqtt_temp_data, "is_active");
                relay_manager_set_active(relay_id_val, is_active);
                LOG_I(TAG, "Relay %s %s", relay_id_val, is_active ? "ACTIVATED" : "DEACTIVATED");
                
                if (find_json_value(mqtt_temp_data, "contact_type", contact_type_val, sizeof(contact_type_val))) {
                    relay_contact_type_t type = (strcmp(contact_type_val, "NC") == 0) ? 
                                              RELAY_CONTACT_NC : RELAY_CONTACT_NO;
                    relay_manager_set_contact_type(relay_id_val, type);
                    LOG_I(TAG, "Relay %s contact type set to %s", relay_id_val, contact_type_val);
                }
                
                if (find_json_value(mqtt_temp_data, "custom_name", custom_name_val, sizeof(custom_name_val))) {
                    if (strlen(custom_name_val) > 0 && strlen(custom_name_val) < 32) {
                        relay_manager_set_name(relay_id_val, custom_name_val);
                        LOG_I(TAG, "Relay %s custom name set to '%.30s'", relay_id_val, custom_name_val);
                    }
                }
                
                vTaskDelay(pdMS_TO_TICKS(500));
                relay_manager_report_initial_states();
            }
        }
    }
    
    if (use_dynamic) {
        free(mqtt_temp_data);
    }
}

static void wifi_state_callback(wifi_manager_state_t state, void *user_data) {
    switch (state) {
        case WIFI_MANAGER_STATE_CONNECTED:
            LOG_I(TAG, "WiFi connected");
            set_wifi_connected(true);
            
            if (g_watchdog_available) {
                watchdog_manager_report_activity(WATCHDOG_CHECK_WIFI);
            }
            
            time_manager_sync_time();
            
            if (esp32_id_manager_get_id(g_esp32_id_buffer, sizeof(g_esp32_id_buffer)) == ESP_OK) {
                if (mqtt_manager_set_esp32_id(g_esp32_id_buffer) == ESP_OK) {
                    mqtt_manager_connect();
                }
            }
            break;
            
        case WIFI_MANAGER_STATE_DISCONNECTED:
            LOG_I(TAG, "WiFi disconnected");
            set_wifi_connected(false);
            set_mqtt_connected(false);
            
            if (g_watchdog_available) {
                esp_err_t ret = watchdog_manager_set_mode(WATCHDOG_MODE_CONFIG);
                if (ret != ESP_OK) {
                    LOG_D(TAG, "Could not set watchdog to config mode");
                }
            }
            break;
            
        case WIFI_MANAGER_STATE_AP_MODE:
            LOG_I(TAG, "WiFi AP mode active");
            set_wifi_connected(false);
            
            if (g_watchdog_available) {
                esp_err_t ret = watchdog_manager_set_mode(WATCHDOG_MODE_CONFIG);
                if (ret != ESP_OK) {
                    LOG_D(TAG, "Could not set watchdog to config mode");
                }
            }
            break;
            
        default:
            break;
    }
}

static void on_wifi_connect_callback(void *user_data) {
    LOG_I(TAG, "WiFi configured via captive portal");
}

static void system_monitor_task(void *pvParameters) {
    LOG_I(TAG, "System monitor task started");
    
    bool task_registered = false;
    int registration_attempts = 0;
    
    vTaskDelay(pdMS_TO_TICKS(2000));
    
    while (!task_registered && registration_attempts < 5) {
        if (g_watchdog_available) {
            esp_err_t wd_ret = watchdog_manager_register_task(NULL, "sys_monitor");
            if (wd_ret == ESP_OK) {
                LOG_I(TAG, "System monitor task registered in watchdog manager");
                task_registered = true;
                break;
            }
        }
        
