PQSolutionsPeru/ESP32-IDF/ESP-IDF-HDDESP32/hddesp32/main/hddesp32_main.c
        registration_attempts++;
        vTaskDelay(pdMS_TO_TICKS(1000));
    }
    
    uint32_t cycle_count = 0;
    bool portal_config_verified = false;
    int64_t connection_stable_start = 0;
    const int64_t VERIFICATION_DELAY_MS = 30000;
    
    while (1) {
        if (task_registered) {
            esp_err_t feed_ret = watchdog_manager_feed();
            if (feed_ret != ESP_OK) {
                LOG_D(TAG, "Watchdog feed failed: %s", esp_err_to_name(feed_ret));
            }
        }
        
        cycle_count++;
        
        if (cycle_count % 60 == 0 && get_relay_manager_initialized()) {
            relay_manager_check_all_states(false);
        }
        
        if (time_manager_should_send_network_info() || g_need_reregister) {
            LOG_I(TAG, "Sending network info");
            esp_err_t ret = mqtt_manager_send_network_info();
            if (ret == ESP_OK) {
                time_manager_mark_network_info_sent();
                g_need_reregister = false;
            }
        }
        
        if (cycle_count % 120 == 0) {
            print_memory_info_simple();
        }
        
        bool wifi_connected = wifi_manager_is_connected();
        bool mqtt_connected = mqtt_manager_is_connected();
        bool time_synced = time_manager_is_synchronized();
        
        set_wifi_connected(wifi_connected);
        set_mqtt_connected(mqtt_connected);
        
        if (wifi_connected) {
            if (g_watchdog_available) {
                watchdog_manager_report_activity(WATCHDOG_CHECK_WIFI);
            }
            
            wifi_mode_t mode;
            if (esp_wifi_get_mode(&mode) == ESP_OK && mode == WIFI_MODE_APSTA) {
                if (mqtt_connected && time_synced && !portal_config_verified) {
                    if (connection_stable_start == 0) {
                        connection_stable_start = esp_timer_get_time() / 1000;
                        LOG_I(TAG, "Full connectivity detected, starting verification timer");
                    } else {
                        int64_t elapsed = (esp_timer_get_time() / 1000) - connection_stable_start;
                        if (elapsed >= VERIFICATION_DELAY_MS) {
                            LOG_I(TAG, "Configuration complete - restarting to STA mode");
                            vTaskDelay(pdMS_TO_TICKS(2000));
                            esp_restart();
                        } else {
                            int64_t remaining = (VERIFICATION_DELAY_MS - elapsed) / 1000;
                            if (cycle_count % 12 == 0) {
                                LOG_I(TAG, "Restart in %lld seconds", remaining);
                            }
                        }
                    }
                } else if (!mqtt_connected || !time_synced) {
                    connection_stable_start = 0;
                }
            }
            
            if (!time_manager_is_synchronized()) {
                time_manager_check_sync();
            }
            
            mqtt_manager_loop(100);
            
            if (mqtt_connected) {
                if (g_watchdog_available) {
                    watchdog_manager_report_activity(WATCHDOG_CHECK_MQTT);
                }
                
                if (cycle_count % 24 == 0) {
                    LOG_I(TAG, "System OK - WiFi+MQTT connected");
                }
            } else {
                if (cycle_count % 24 == 0) {
                    LOG_I(TAG, "Retrying MQTT connection");
                    if (esp32_id_manager_get_id(g_esp32_id_buffer, sizeof(g_esp32_id_buffer)) == ESP_OK) {
                        mqtt_manager_set_esp32_id(g_esp32_id_buffer);
                        mqtt_manager_connect();
                    }
                }
            }
        } else {
            connection_stable_start = 0;
            
            if (cycle_count % 6 == 0) {
                LOG_I(TAG, "WiFi disconnected - running recovery cycle");
                wifi_manager_handle_disconnection("FirePanel", "firepanel", 10);
            }
        }
        
        if (g_watchdog_available && cycle_count % 60 == 0) {
            watchdog_health_status_t health = watchdog_manager_check_system_health();
            if (health > WATCHDOG_HEALTH_WARNING) {
                LOG_W(TAG, "System health degraded: %d", health);
            }
        }
        
        vTaskDelay(pdMS_TO_TICKS(5000));
    }
}

void app_main(void)
{
    LOG_I(TAG, "Starting HDD ESP32 Monitor v2.0 (ESP-IDF v5.4.1)");

    LOG_I(TAG, "Phase 1: Basic initialization");

    g_callback_mutex = xSemaphoreCreateMutex();
    g_global_state_mutex = xSemaphoreCreateMutex();
    
    esp_err_t watchdog_ret = watchdog_manager_init();
    if (watchdog_ret != ESP_OK) {
        LOG_E(TAG, "Failed to initialize watchdog manager: %s", esp_err_to_name(watchdog_ret));
        
        LOG_W(TAG, "Retrying watchdog initialization after delay...");
        vTaskDelay(pdMS_TO_TICKS(3000));
        
        watchdog_ret = watchdog_manager_init();
        if (watchdog_ret != ESP_OK) {
            LOG_E(TAG, "Watchdog initialization failed twice: %s", esp_err_to_name(watchdog_ret));
            LOG_E(TAG, "CRITICAL: System cannot function safely without watchdog");
            vTaskDelay(pdMS_TO_TICKS(5000));
            esp_restart();
        }
    }
    
    LOG_I(TAG, "Watchdog manager initialized successfully");
    g_watchdog_available = true;
    
    watchdog_manager_set_event_callback(watchdog_event_callback, NULL);
    
    vTaskDelay(pdMS_TO_TICKS(1000));
    
    bool main_task_registered = false;
    int main_reg_attempts = 0;
    while (!main_task_registered && main_reg_attempts < 5) {
        esp_err_t reg_ret = watchdog_manager_register_task(NULL, "app_main");
        if (reg_ret == ESP_OK) {
            LOG_I(TAG, "Main task registered in watchdog manager");
            main_task_registered = true;
        } else {
            LOG_W(TAG, "Main task registration attempt %d failed: %s", 
                    main_reg_attempts + 1, esp_err_to_name(reg_ret));
            main_reg_attempts++;
            vTaskDelay(pdMS_TO_TICKS(1000));
        }
    }
    
    if (!main_task_registered) {
        LOG_E(TAG, "CRITICAL: Could not register main task in watchdog");
        esp_restart();
    }
    
