PQSolutionsPeru/ESP32-IDF/ESP-IDF-HDDESP32/hddesp32/main/hddesp32_main.c
    ESP_ERROR_CHECK(config_manager_init());
    if (main_task_registered) {
        esp_err_t feed_ret = watchdog_manager_feed();
        if (feed_ret != ESP_OK) {
            LOG_W(TAG, "Initial watchdog feed failed: %s", esp_err_to_name(feed_ret));
        }
    }
    
    ESP_ERROR_CHECK(esp32_id_manager_init());
    if (main_task_registered) {
        watchdog_manager_feed();
    }
    
    ESP_ERROR_CHECK(esp32_id_manager_get_id(g_esp32_id_buffer, sizeof(g_esp32_id_buffer)));
    LOG_I(TAG, "ESP32 ID: %s", g_esp32_id_buffer);
    
    char mac_address[ESP32_MAC_STR_LENGTH + 1];
    ESP_ERROR_CHECK(esp32_id_manager_get_mac(mac_address, sizeof(mac_address)));
    LOG_I(TAG, "MAC: %s", mac_address);
    
    if (main_task_registered) {
        watchdog_manager_feed();
    }
    
    LOG_I(TAG, "Phase 2: Manager initialization");
    
    ESP_ERROR_CHECK(wifi_manager_init());
    if (main_task_registered) {
        watchdog_manager_feed();
    }
    
    ESP_ERROR_CHECK(time_manager_init());
    if (main_task_registered) {
        watchdog_manager_feed();
    }
    
    ESP_ERROR_CHECK(mqtt_manager_init());
    if (main_task_registered) {
        watchdog_manager_feed();
    }
    
    LOG_I(TAG, "Phase 3: Callback configuration");
    
    ESP_ERROR_CHECK(wifi_manager_set_state_callback(wifi_state_callback, NULL));
    ESP_ERROR_CHECK(mqtt_manager_set_state_callback(mqtt_state_callback, NULL));
    ESP_ERROR_CHECK(mqtt_manager_set_message_callback(mqtt_message_callback, NULL));
    ESP_ERROR_CHECK(mqtt_manager_set_esp32_id(g_esp32_id_buffer));
    
    if (main_task_registered) {
        watchdog_manager_feed();
    }
    
    char saved_client_id[32] = {0};
    char saved_panel_id[32] = {0};

    if (config_manager_get_str("client_id", saved_client_id, sizeof(saved_client_id)) == ESP_OK &&
        config_manager_get_str("panel_id", saved_panel_id, sizeof(saved_panel_id)) == ESP_OK &&
        strlen(saved_client_id) > 0 && strlen(saved_panel_id) > 0) {
        
        LOG_I(TAG, "Found saved configuration: client=%s, panel=%s", saved_client_id, saved_panel_id);
        mqtt_manager_set_panel_config(saved_client_id, saved_panel_id);
    }
    
    LOG_I(TAG, "Phase 4: WiFi connection");

    esp_err_t wifi_ret = wifi_manager_connect_saved();
    if (wifi_ret != ESP_OK) {
        char ap_ssid[33];
        ESP_ERROR_CHECK(wifi_manager_generate_ap_ssid(ap_ssid, sizeof(ap_ssid), "FirePanel"));
        
        LOG_I(TAG, "No saved credentials - starting captive portal: %s", ap_ssid);
        ESP_ERROR_CHECK(wifi_captive_portal_start(ap_ssid, "firepanel"));
        ESP_ERROR_CHECK(wifi_captive_portal_set_on_connect_callback(on_wifi_connect_callback, NULL));
        
        if (g_watchdog_available) {
            watchdog_manager_set_mode(WATCHDOG_MODE_CONFIG);
        }
    } else {
        LOG_I(TAG, "WiFi connection initiated - will connect in background");
    }
    
    LOG_I(TAG, "Phase 5: Creating system monitor task");
    
    TaskHandle_t monitor_task_handle = NULL;
    BaseType_t xReturned = xTaskCreate(
        system_monitor_task,
        "sys_monitor",
        12288,
        NULL,
        5,
        &monitor_task_handle
    );
    
    if (xReturned != pdPASS || monitor_task_handle == NULL) {
        LOG_E(TAG, "Failed to create system monitor task");
        LOG_E(TAG, "CRITICAL: System cannot function without monitor task");
        
        if (g_watchdog_available) {
            watchdog_manager_force_reset("monitor_task_creation_failed");
        } else {
            esp_restart();
        }
    }
    
    vTaskDelay(pdMS_TO_TICKS(2000));
    
    g_system_initialized = true;
    LOG_I(TAG, "System initialization completed successfully");
    
    uint32_t main_cycle = 0;
    uint32_t main_feed_errors = 0;
    
    while (1) {
        if (main_task_registered) {
            esp_err_t feed_ret = watchdog_manager_feed();
            if (feed_ret != ESP_OK) {
                main_feed_errors++;
                LOG_W(TAG, "Main task watchdog feed failed: %s (count: %lu)", 
                        esp_err_to_name(feed_ret), main_feed_errors);
                
                if (main_feed_errors >= 30) {
                    LOG_E(TAG, "Too many main feed failures, attempting re-registration");
                    watchdog_manager_unregister_task(NULL);
                    vTaskDelay(pdMS_TO_TICKS(1000));
                    
                    esp_err_t reg_ret = watchdog_manager_register_task(NULL, "app_main");
                    if (reg_ret == ESP_OK) {
                        LOG_I(TAG, "Main task re-registered successfully");
                        main_feed_errors = 0;
                    } else {
                        LOG_E(TAG, "CRITICAL: Cannot re-register main task");
                        esp_restart();
                    }
                }
            } else {
                if (main_feed_errors > 0) {
                    main_feed_errors = 0;
                }
            }
        }
        
        main_cycle++;
        
        if (main_cycle % 12 == 0) {
            if (g_watchdog_available) {
                uint32_t feed_count, error_count;
                const char *last_reset_reason;
                
                if (watchdog_manager_get_stats(&feed_count, &error_count, &last_reset_reason) == ESP_OK) {
                    if (error_count > 100) {
                        LOG_W(TAG, "High watchdog error count: %lu (feeds: %lu, last reset: %s)", 
                                error_count, feed_count, last_reset_reason ? last_reset_reason : "none");
                    }
                }
                
                watchdog_mode_t current_mode = watchdog_manager_get_mode();
                if (current_mode == WATCHDOG_MODE_CRITICAL) {
                    LOG_W(TAG, "System running in CRITICAL mode");
                }
            }
        }
        
        if (main_cycle % 60 == 0) {
            size_t free_heap = esp_get_free_heap_size();
            size_t min_heap = esp_get_minimum_free_heap_size();
            LOG_I(TAG, "Main task: heap free=%zu min=%zu", free_heap, min_heap);
        }
        
        vTaskDelay(pdMS_TO_TICKS(5000));
    }
    
    if (get_relay_manager_initialized()) {
        LOG_I(TAG, "Cleaning up Relay Manager");
        relay_manager_deinit();
        set_relay_manager_initialized(false);
    }
}